# ─── Terminal & CLI Tools (Formulae) ─────────────

# Shell & Prompt
brew "fish"
brew "fisher"

# CLI Utilities & System Tools
brew "gh"
brew "btop"
brew "fastfetch"
brew "docker-compose"
brew "cloudflared"
brew "k6"
brew "redis"

# JavaScript / TypeScript
brew "node"
brew "pnpm"
brew "vite"
brew "typescript"

# Python
brew "python@3.13"
brew "uv"

# Other Languages & Build Tools
brew "go"
brew "rustup"
brew "maven"

# Editor & Terminal Environment
brew "vim"
brew "tmux"
brew "tpm"


# ─── GUI Applications & Fonts (Casks) ─────────────

# AI & LLM Tools
cask "claude"
cask "claude-code"
cask "google-gemini"
cask "ollama-app"

# IDEs & Code Editors
cask "visual-studio-code"
cask "zed"
cask "intellij-idea"
cask "pycharm-ce"

# Database & API Tools
cask "dbeaver-community"
cask "postman"

# Terminals & Dev Infrastructure
cask "wezterm"
cask "docker-desktop"
cask "antigravity-cli"

# Design, Media & Content Creation
cask "figma"
cask "canva"
cask "capcut"

# Communication & Browsers
cask "google-chrome"
cask "discord"
cask "telegram"

# Productivity & Notes
cask "notion"
cask "obsidian"

# System Utilities & Misc
cask "betterdisplay"
cask "batfi"
cask "maccy"
cask "pearcleaner"
cask "filezilla"
cask "vlc"
cask "spotify"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"
