# Taps
# Deprecated core taps removed

# Formulae
brew "btop"
brew "clang-format"
brew "cloudflared"
brew "cmake"
brew "cocoapods"
brew "docker-compose"
brew "fastfetch"
brew "fish"
brew "fisher"
brew "gh"
brew "go"
brew "k6"
brew "maven"
brew "neovim"
brew "node"
brew "pnpm"
brew "python@3.13"
brew "redis"
brew "rustup"
# brew "starship" # Removed in favor of Tide
brew "tmux"
brew "tpm"
brew "typescript"
brew "uv"
brew "vim"
brew "vite"
brew "zsh"

# Casks
cask "android-studio"
cask "antigravity-cli"
cask "betterdisplay"
cask "claude-code"
cask "docker"
cask "docker-desktop"
cask "flutter"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "maccy"
cask "pearcleaner"
cask "wezterm"
